//
//  answer.swift
//  work10_heartApp
//
//  Created by 彭有駿 on 2022/4/23.
//

import Foundation

struct option{
    
    var opt : String
    var ans : String
    
}

let options = [

option(opt: "A.珊瑚",ans: "選擇珊瑚的人，代表你的精神年齡還停留在『小朋友心態』，雖然你有夢想，也心懷遠方，但是！你不但有拖延症，做事缺乏行動力，屬於多說少做的、情緒微急躁的類型。"),
option(opt: "B.兩條魚",ans: "選擇兩條魚的人，代表你是一個充滿矛盾的個體，看似堅強成熟，實際上內心脆弱敏感，面對陌生人時微內向溫和有禮，但只要多跟你見過幾次面就能知道其實你是個瘋狂的人！"),
option(opt: "C.一群魚",ans: "選擇一群魚的人，代表你是一個害怕及的人，日常比較喜歡群體生活，性格方面你有選擇恐懼症，遇到選項時會偏好詢問身邊的人意見，依賴性很強。"),
option(opt: "D.一條海蛇",ans: "選擇一條海蛇的人，代表你是一個相當成熟的人，對家庭有責任感、在事業上有上進心，性格較獨立，無論遇到什麼難題都會冷靜解決。不習慣示弱的個性，會用堅強偽裝自己所遇到的委屈、習慣自我消化，不過也因此常常感覺很累。")

]


struct option2{
    var opt2 : String
    var ans2 : String
}
var options2 = [

    option2(opt2: "A.山",ans2: "選擇山的人，代表你希望另一半是個有智慧、有能力，能帶給你安全感的人。"),
    option2(opt2: "B.小魚",ans2: "選擇小魚的人，代表你希望另一半是個成熟穩重、有擔當，他可以在小事上包容你，大事上又能夠引導你的人。"),
    option2(opt2: "C.小屋",ans2: "選擇小屋的人，代表你希望另一半事業有成，和他在一起後，可以無憂無慮隨心所欲過自己想過的生活。"),
    option2(opt2: "D.小鳥",ans2: "選擇小鳥的人，代表你希望另一半外表、身材都要高水準，同時希望對方不是個愛黏你的人。")

]

struct option3{
    var opt3 : String
    var ans3 : String
}
var options3 = [

    option3(opt3: "A.豹",ans3: "選擇豹當寵物的人，代表雖然你想結婚，但卻不知道該如何經營婚姻，應該說你其實是很害怕婚後的生活還不如自己一個人過得自在。"),
    option3(opt3: "B.恐龍",ans3: "選擇恐龍的人，代表你對婚姻很消極，認為世界上沒有完美的婚姻存在，結婚這件事對你來說可有可無，更注重的是現在的陪伴。"),
    option3(opt3: "C.老虎",ans3: "選擇老虎的人，代表你認為結婚是一件大事，既然決定走入婚姻殿堂，你勢必會超珍惜這段婚姻，並且盡最大力量去用心經營維護。"),
    option3(opt3: "D.北極熊",ans3: "選擇北極熊的人，代表你有婚姻恐懼症，認為結婚只會失去自由，柴米油鹽、婆媳關係這些問題想想就頭痛啊～")

]
struct option4{
    var opt4 : String
    var ans4: String
}
var options4 = [

    option4(opt4: "A.大海",ans4: "選擇大海的人，代表你要進入一個很棒的階段，屬於心想事成的狀態，你會遇到一些很不錯的機會，你的小願望也有可能會實現！"),
    option4(opt4: "B.小溪",ans4: "選擇小溪的人，代表你正在想辦法扭轉現狀，雖然當下你充滿不安和彷徨，但你相信這些都只是暫時的。"),
    option4(opt4: "C.瀑布",ans4: "選擇瀑布的人，代表你當下的狀態很不錯，而且未來一段時間的運勢也會不錯，所以去做你想做的事情，你會得到自己想要的結果的。"),
    option4(opt4: "D.湖泊",ans4: "選擇湖泊的人，代表你的性格很謹慎、做事多疑，對未來相當迷茫，內心焦慮、認為自己失敗，想改變卻不知道該怎麼做。")

]
